---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.MepAnalyticalPipeDesignflow
source: html/b2a199ff-5517-3955-e034-44c4fc65af4f.htm
---
# Autodesk.Revit.DB.ParameterTypeId.MepAnalyticalPipeDesignflow Property

"Design Flow"

## Syntax (C#)
```csharp
public static ForgeTypeId MepAnalyticalPipeDesignflow { get; }
```